DocumentJournals/ТК_ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>ТК_ЗаказыПокупателей</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Автор</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.Автор</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Договор</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.ДоговорВзаиморасчетов</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>АдресДоставки</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.ТочкаДоставки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.РегламентированныйУчет</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Склад</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.СкладКомпании</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СрокПоставки</Name>
					<References>
						<xr:Item>Document.ЗаказПокупателя.Attribute.СрокПоставки</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Enums/ПриоритетыСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПриоритетыСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОченьНизкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОченьВысокий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСборкиРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыСборкиРезервов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГотовКСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
					<Comment>Статус для документов собранных и сформированы документы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рекламация</Name>
					<Comment>статус для акта</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованоРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованоСБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоСБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DocumentJournals/ТК_ЗаказыПокупателей/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Приоритет = ВернутьЗначение();
	Статус = ВернутьЗначениеСтатуса();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьЗначение()
	Возврат Перечисления.ПриоритетыСборки.Средний;	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьЗначениеСтатуса()
	Возврат Перечисления.СтатусыСборкиРезервов.Собран;	
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	СтруктураРезультат = Новый Структура;
	Если ПометкаСтатус Тогда
		СтруктураРезультат.Вставить("Статус", Статус);
	Иначе 
		СтруктураРезультат.Вставить("Статус", Неопределено);
	КонецЕсли;
	
	Если ПометкаПриоритет Тогда
		 СтруктураРезультат.Вставить("Приоритет", Приоритет);
	Иначе
		 СтруктураРезультат.Вставить("Приоритет", Неопределено);
	КонецЕсли;
	
	Закрыть(СтруктураРезультат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКарточку(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ЗаполнитьКатрочку", Истина);
	СтруктураРезультат.Вставить("Статус", 	 Статус);
	СтруктураРезультат.Вставить("Приоритет", Приоритет);
	СтруктураРезультат.Вставить("Сотрудник", Сотрудник);
	СтруктураРезультат.Вставить("СотрудникКонтроля", СотрудникКонтроля);
	СтруктураРезультат.Вставить("Упаковщик", Упаковщик);
	СтруктураРезультат.Вставить("НачалоСборки", НачалоСборки);
	СтруктураРезультат.Вставить("КонецСборки", КонецСборки);
	СтруктураРезультат.Вставить("НачалоКонтроля", НачалоКонтроля);
	СтруктураРезультат.Вставить("КонецКонтроля", КонецКонтроля);
	
	Закрыть(СтруктураРезультат);


КонецПроцедуры
